-- phpMyAdmin SQL Dump
-- version 4.0.4.1
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Jul 07, 2013 at 02:42 PM
-- Server version: 5.5.31-0ubuntu0.12.10.1
-- PHP Version: 5.4.6-1ubuntu1.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `hrm`
--
CREATE DATABASE IF NOT EXISTS `hrm` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `hrm`;

-- --------------------------------------------------------

--
-- Table structure for table `tb_code`
--

CREATE TABLE IF NOT EXISTS `tb_code` (
  `code` varchar(4) NOT NULL,
  `upper_code` varchar(4) DEFAULT NULL,
  `code_name` varchar(50) NOT NULL,
  `cat` varchar(20) NOT NULL,
  PRIMARY KEY (`code`,`cat`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `tb_code`
--

INSERT INTO `tb_code` (`code`, `upper_code`, `code_name`, `cat`) VALUES
('1', '', '공채', 'recruit_type'),
('10', '', '솔로몬 테크노 서플라이', 'company_code'),
('10', '', '대표이사', 'duty_code'),
('10', '', '본사', 'loc_code'),
('10', '', '대표이사', 'pos_code'),
('1000', 'org', '솔로몬 테크노 서플라이', 'dept_code'),
('11', '', '솔로몬', 'company_code'),
('11', '', '소하', 'loc_code'),
('12', '', '양재', 'loc_code'),
('13', '', '사장', 'duty_code'),
('13', '', '여의도', 'loc_code'),
('13', '', '사장', 'pos_code'),
('14', '', '의왕', 'loc_code'),
('15', '', '부사장', 'duty_code'),
('15', '', '전주', 'loc_code'),
('15', '', '부사장', 'pos_code'),
('16', '', '남양', 'loc_code'),
('2', '', '추천', 'recruit_type'),
('20', '', '담당임원', 'duty_code'),
('20', '', '전무', 'pos_code'),
('25', '', '상무', 'pos_code'),
('3', '', '경력', 'recruit_type'),
('30', '', '이사', 'pos_code'),
('40', '', '사업부장', 'duty_code'),
('40', '', '부장', 'pos_code'),
('50', '', '차장', 'pos_code'),
('60', '', '과장', 'pos_code'),
('70', '', '팀장', 'duty_code'),
('70', '', '대리', 'pos_code'),
('80', '', '주임', 'pos_code'),
('90', '', '사원', 'pos_code'),
('AAAA', 'AAA_', '경영지원팀', 'dept_code'),
('AAAB', '', '사업지원팀', 'dept_code'),
('AAA_', 'A___', '경영지원부', 'dept_code'),
('A___', '1000', '지원담당', 'dept_code'),
('BAAA', 'BAA_', 'IDC운영팀', 'dept_code'),
('BAAB', 'BAA_', 'E-BIZ팀', 'dept_code'),
('BAAC', 'BAA_', 'MES팀', 'dept_code'),
('BAAD', 'BAA_', 'ICC팀', 'dept_code'),
('BAAE', 'BAA_', '그룹사인프라지원팀', 'dept_code'),
('BAA_', 'B___', '인프라사업부', 'dept_code'),
('BABA', 'BAB_', '양재지원팀', 'dept_code'),
('BABB', 'BAB_', '소하지원팀', 'dept_code'),
('BABC', 'BAB_', '의왕지원팀', 'dept_code'),
('BAB_', 'B___', '시스템사업부', 'dept_code'),
('BACA', 'BAC_', 'HCC지원팀', 'dept_code'),
('BACB', 'BAC_', '현대해상지원팀', 'dept_code'),
('BAC_', 'B___', '금융사업부', 'dept_code'),
('BAD_', 'B___', '유럽법인', 'dept_code'),
('BAE_', 'B___', '북미법인', 'dept_code'),
('BAF_', 'B___', 'SI개발팀', 'dept_code'),
('BAZ_', 'B___', '기업부설연구소', 'dept_code'),
('B___', '0000', '사업담당', 'dept_code'),
('code', 'uppe', 'code_name', 'cat');

-- --------------------------------------------------------

--
-- Table structure for table `tb_employee`
--

CREATE TABLE IF NOT EXISTS `tb_employee` (
  `emp_id` varchar(15) NOT NULL,
  `ssn` varchar(14) NOT NULL,
  `emp_name` varchar(10) NOT NULL,
  `emp_name_eng` varchar(20) NOT NULL,
  `emp_name_chi` varchar(20) NOT NULL,
  `dept_code` varchar(4) NOT NULL,
  `dept_name` varchar(50) NOT NULL,
  `duty_code` varchar(2) NOT NULL,
  `duty_name` varchar(20) NOT NULL,
  `pos_code` varchar(2) NOT NULL,
  `pos_name` varchar(20) NOT NULL,
  `company_code` varchar(2) NOT NULL,
  `company_name` varchar(50) NOT NULL,
  `loc_code` varchar(2) NOT NULL,
  `loc_name` varchar(30) NOT NULL,
  `home_phone` varchar(15) NOT NULL,
  `work_phone` varchar(15) NOT NULL,
  `mobile` varchar(15) NOT NULL,
  `email` varchar(50) NOT NULL,
  `birthday` date NOT NULL,
  `islunar` varchar(1) NOT NULL,
  `recruit_type` varchar(1) NOT NULL,
  `address` varchar(200) NOT NULL,
  `address_origin` varchar(200) NOT NULL,
  `join_date` date NOT NULL,
  `retire_cal_date` date NOT NULL,
  `retire_date` date NOT NULL,
  `reg_date` datetime NOT NULL,
  `memo` varchar(1000) NOT NULL,
  PRIMARY KEY (`emp_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `tb_employee`
--

INSERT INTO `tb_employee` (`emp_id`, `ssn`, `emp_name`, `emp_name_eng`, `emp_name_chi`, `dept_code`, `dept_name`, `duty_code`, `duty_name`, `pos_code`, `pos_name`, `company_code`, `company_name`, `loc_code`, `loc_name`, `home_phone`, `work_phone`, `mobile`, `email`, `birthday`, `islunar`, `recruit_type`, `address`, `address_origin`, `join_date`, `retire_cal_date`, `retire_date`, `reg_date`, `memo`) VALUES
('11111', '', '유승호', '', '', 'BAA_', '인프라사업부', '40', '사업부장', '25', '상무', '10', '솔로몬테크노서플라이', '10', '본사', '', '02-2345-2000', '010-1234-2000', '11111@solomontech.net', '0000-00-00', '+', '3', '고양', '고양', '0000-00-00', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11112', '', '문정의', '', '', 'BAAB', 'E-BIZ팀', '70', '팀장', '40', '부장', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2001', '010-6734-3487', '11112@solomontech.net', '1969-08-13', '+', '3', '서울', '서울', '2009-02-02', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11113', '', '박대병', '', '', 'BAAB', 'E-BIZ팀', '', '', '50', '차장', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2002', '010-9119-1662', '11113@solomontech.net', '1974-10-28', '-', '3', '시흥', '시흥', '2010-02-17', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11114', '', '박재열', '', '', 'BAAB', 'E-BIZ팀', '', '', '50', '차장', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2003', '010-3945-1716', '11114@solomontech.net', '1973-02-10', '+', '3', '부천', '부천', '2010-03-02', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11115', '', '김경태', '', '', 'BAAB', 'E-BIZ팀', '', '', '50', '차장', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2004', '010-6277-7828', '11115@solomontech.net', '1973-10-20', '+', '3', '서울', '서울', '2012-07-09', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11116', '', '김영미', '', '', 'BAAB', 'E-BIZ팀', '', '', '80', '주임', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2005', '010-6734-3487', '11116@solomontech.net', '1987-09-02', '+', '1', '인천', '인천', '2010-07-29', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11117', '', '주가영', '', '', 'BAAB', 'E-BIZ팀', '', '', '80', '주임', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2006', '010-3204-0460', '11117@solomontech.net', '1985-03-14', '+', '1', '광명', '광명', '2010-10-04', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11118', '', '정소영', '', '', 'BAAB', 'E-BIZ팀', '', '', '80', '주임', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2007', '010-7182-1424', '11118@solomontech.net', '1980-12-04', '+', '1', '광명', '광명', '2010-05-10', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11119', '', '박병준', '', '', 'BAAB', 'E-BIZ팀', '', '', '70', '대리', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2008', '010-7457-2202', '11119@solomontech.net', '1979-08-21', '+', '1', '광명', '광명', '2004-12-26', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11120', '', '정지호', '', '', 'BAAB', 'E-BIZ팀', '', '', '90', '사원', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2009', '010-9137-3474', '11120@solomontech.net', '1983-06-03', '+', '1', '광명', '광명', '2013-05-01', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11121', '', '안기주', '', '', 'BAAB', 'E-BIZ팀', '', '', '90', '사원', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2010', '010-6233-6443', '11121@solomontech.net', '1987-09-19', '+', '1', '안양', '안양', '2013-07-15', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11122', '', '박기철', '', '', 'BAAB', 'E-BIZ팀', '', '', '60', '과장', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2011', '010-6766-0772', '11122@solomontech.net', '1979-06-06', '+', '3', '서울', '서울', '2011-01-17', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11123', '', '정대진', '', '', 'BAAB', 'E-BIZ팀', '', '', '60', '과장', '10', '솔로몬테크노서플라이', '13', '여의도', '', '02-2345-2012', '010-2352-7624', '11123@solomontech.net', '1979-06-26', '+', '3', '부천', '부천', '2011-07-18', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11124', '', '주진섭', '', '', 'BAAB', 'E-BIZ팀', '', '', '60', '과장', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2013', '011-772-7524', '11124@solomontech.net', '1980-04-07', '-', '1', '수원', '수원', '2006-04-01', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11125', '', '이주연', '', '', 'BAAB', 'E-BIZ팀', '', '', '70', '대리', '10', '솔로몬테크노서플라이', '13', '여의도', '', '02-2345-2014', '010-3342-6065', '11125@solomontech.net', '1982-06-04', '+', '3', '광명', '광명', '2011-06-01', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11126', '', '진민희', '', '', 'BAAB', 'E-BIZ팀', '', '', '70', '대리', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2015', '010-4723-7971', '11126@solomontech.net', '1979-07-01', '+', '3', '광명', '광명', '2011-06-13', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11127', '', '박석원', '', '', 'BAAB', 'E-BIZ팀', '', '', '70', '대리', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2016', '010-6321-9306', '11127@solomontech.net', '0000-00-00', '+', '3', '인천', '인천', '2013-04-15', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11128', '', '추연욱', '', '', 'BAAB', 'E-BIZ팀', '', '', '70', '대리', '10', '솔로몬테크노서플라이', '13', '여의도', '', '02-2345-2017', '010-8589-1146', '11128@solomontech.net', '1983-07-09', '+', '1', '서울', '서울', '2007-03-15', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11129', '', '방순현', '', '', 'BAAB', 'E-BIZ팀', '', '', '70', '대리', '10', '솔로몬테크노서플라이', '13', '여의도', '', '02-2345-2018', '010-6356-9875', '11129@solomontech.net', '1982-02-28', '+', '1', '광명', '광명', '2009-03-16', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11130', '', '신제헌', '', '', 'BAAB', 'E-BIZ팀', '', '', '70', '대리', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2019', '010-6362-7876', '11130@solomontech.net', '1981-07-04', '+', '1', '안양', '안양', '2009-04-14', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11131', '', '김성수', '', '', 'BAAB', 'E-BIZ팀', '', '', '60', '과장', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2020', '010-8382-3482', '11131@solomontech.net', '1975-09-24', '+', '3', '수원', '수원', '2011-12-16', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11132', '', '박인식', '', '', 'BAAB', 'E-BIZ팀', '', '', '60', '과장', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2021', '010-3465-7997', '11132@solomontech.net', '1978-02-25', '-', '1', '광명', '광명', '2001-11-07', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11133', '', '조혜경', '', '', 'BAAB', 'E-BIZ팀', '', '', '60', '과장', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2022', '010-8733-2818', '11133@solomontech.net', '1976-09-25', '+', '3', '광명', '광명', '2008-06-09', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11134', '', '양성운', '', '', 'BAAB', 'E-BIZ팀', '', '', '70', '대리', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2023', '010-5124-0042', '11134@solomontech.net', '1980-02-25', '+', '3', '부천', '부천', '2011-10-17', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11135', '', '김수종', '', '', 'BAAB', 'E-BIZ팀', '', '', '90', '사원', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2024', '010-5171-8387', '11135@solomontech.net', '1983-12-09', '+', '1', '광명', '광명', '2012-03-05', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11136', '', '이형진', '', '', 'BAAB', 'E-BIZ팀', '', '', '90', '사원', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2025', '010-3257-0219', '11136@solomontech.net', '1983-02-19', '+', '1', '안양', '안양', '2012-03-05', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11137', '', '주은경', '', '', 'BAAB', 'E-BIZ팀', '', '', '90', '사원', '10', '솔로몬테크노서플라이', '11', '소하', '', '02-2345-2026', '010-8788-8690', '11137@solomontech.net', '0000-00-00', '+', '1', '광명', '광명', '2012-09-04', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', ''),
('11138', '', '심상연', '', '', 'BAAB', 'E-BIZ팀', '', '', '80', '주임', '10', '솔로몬테크노서플라이', '13', '여의도', '', '02-2345-2027', '010-3313-4695', '11138@solomontech.net', '1981-12-02', '+', '1', '광명', '광명', '2011-02-07', '0000-00-00', '0000-00-00', '2013-08-01 00:00:00', '');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
